Revit 2027 API
HVACZoneData.ZoneEquipmentId Property
 The id of the zone equipment related to the zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ZoneEquipmentId { get; set; }
Public Property ZoneEquipmentId As ElementId
	Get
	Set
public:
property ElementId^ ZoneEquipmentId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ZoneEquipmentId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
HVACZoneData Class
Autodesk.Revit.DB.Mechanical Namespace